In [1]:
import pandas as pd
import numpy as np

## Semicolon

In [2]:
caminho='C:/Users/William/Desktop/Programando Py/'
arquivo='semmicomma.txt'

In [3]:
path1=caminho+arquivo
path1

'C:/Users/William/Desktop/Programando Py/semmicomma.txt'

In [4]:
df1 = pd.read_csv(path1, sep=';', dtype='unicode',engine='python',skiprows=0)
df1.head()

       CPF Matrícula Nome Centro_de_Custo Valor
0  8301607     37788   A1          C19751   480
1  2880529     42950   A2          C78006  2261
2  1765770     59895   A3          D16400   382
3  3413183     67318   A4          C63529   448
4  2305859     45910   A5          C49036  2684

## Comma

In [5]:
arquivo2='comma.txt'

In [6]:
path2=caminho+arquivo2
path2

'C:/Users/William/Desktop/Programando Py/comma.txt'

In [7]:
df2 = pd.read_csv(path2, sep=',', dtype='unicode',engine='python',skiprows=0)
df2.head()

       CPF Matrícula Nome Centro_de_Custo Valor
0  8301607     37788   A1          C19751   480
1  2880529     42950   A2          C78006  2261
2  1765770     59895   A3          D16400   382
3  3413183     67318   A4          C63529   448
4  2305859     45910   A5          C49036  2684

## Rashtag

In [8]:
arquivo3='rashtag.txt'

In [9]:
path3=caminho+arquivo3
path3

'C:/Users/William/Desktop/Programando Py/rashtag.txt'

In [10]:
df3 = pd.read_csv(path3, sep='\#', dtype='unicode',engine='python',skiprows=0)
df3.head()

       CPF Matrícula Nome Centro_de_Custo Valor
0  8301607     37788   A1          C19751   480
1  2880529     42950   A2          C78006  2261
2  1765770     59895   A3          D16400   382
3  3413183     67318   A4          C63529   448
4  2305859     45910   A5          C49036  2684

## Barra Vertical

In [11]:
arquivo4='barra_vertical.txt'

In [12]:
path4=caminho+arquivo4
path4

'C:/Users/William/Desktop/Programando Py/barra_vertical.txt'

In [13]:
df4 = pd.read_csv(path4, sep='\|', dtype='unicode',engine='python',skiprows=0, index_col=False)
df4.head()

       CPF Matrícula Nome Centro_de_Custo Valor
0  8301607     37788   A1          C19751   480
1  2880529     42950   A2          C78006  2261
2  1765770     59895   A3          D16400   382
3  3413183     67318   A4          C63529   448
4  2305859     45910   A5          C49036  2684

## Fixed

In [14]:
arquivo5='fixed.txt'

In [15]:
path5=caminho+arquivo5
path5

'C:/Users/William/Desktop/Programando Py/fixed.txt'

In [16]:
# Using Pandas with a column specification
col_specification = [(0, 7), (7, 16), (16, 22), (22, 30),(30,40)]
df5 = pd.read_fwf(path5, colspecs=col_specification,skiprows=0)
df5.head()

   CPF   M  atrícula Nome   Centr  o_de_Custo
0  8301607     37788   A1  C19751         480
1  2880529     42950   A2  C78006        2261
2  1765770     59895   A3  D16400         382
3  3413183     67318   A4  C63529         448
4  2305859     45910   A5  C49036        2684

## XLSX

In [17]:
arquivo6='gerador.xlsx'

In [18]:
path6=caminho+arquivo6
path6

'C:/Users/William/Desktop/Programando Py/gerador.xlsx'

In [19]:
df6 = pd.read_excel(path6,sheet_name=1,header=0)
df6.head()

   CPF   M  atrícula Nome   Centr  o_de_Custo   Valor
0  8301607     37788   A1  C19751                 480
1  2880529     42950   A2  C78006                2261
2  1765770     59895   A3  D16400                 382
3  3413183     67318   A4  C63529                 448
4  2305859     45910   A5  C49036                2684

In [20]:
cols=df6.columns

In [21]:
df6.index

RangeIndex(start=0, stop=39, step=1)

# Tentando usar pivot

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html

In [22]:
pd.DataFrame(data=df6.values,columns=cols, index=None).head()

   CPF   M atrícula Nome   Centr o_de_Custo   Valor
0  8301607    37788   A1  C19751                480
1  2880529    42950   A2  C78006               2261
2  1765770    59895   A3  D16400                382
3  3413183    67318   A4  C63529                448
4  2305859    45910   A5  C49036               2684

In [23]:
df4.describe()

            CPF Matrícula Nome Centro_de_Custo Valor
count        39        39   39              39    39
unique       22        22   22              22    39
top     6211373     54880   A6          C39952  1136
freq          4         4    4               4     1

In [39]:
df4.dtypes

CPF                object
Matrícula          object
Nome               object
Centro_de_Custo    object
Valor              object
dtype: object

In [40]:
################Importante
convert_dict={'Valor':float}

In [43]:
################Importante
df41=df4.astype(convert_dict)
print(df41.dtypes)

CPF                 object
Matrícula           object
Nome                object
Centro_de_Custo     object
Valor              float64
dtype: object

In [71]:
df4.loc('Centro_de_Custo'=C39952)

SyntaxError: keyword can't be an expression (<ipython-input-71-dfc22e6127d6>, line 1)

In [68]:
pd.pivot_table(df41,values=['Valor'],index=['Centro_de_Custo','Matrícula'],aggfunc=np.sum)

                            Valor
Centro_de_Custo Matrícula
B21652          24338        74.0
B39244          71007      1379.0
B65036          69901      2919.0
B75592          89353      2109.0
B78962          25890      1420.0
B89499          28159      3552.0
B90811          72522      1448.0
C19751          37788       480.0
C22903          64710      2475.0
C27388          33431      3191.0
C39952          54880      2255.0
C49036          45910      8579.0
C60653          83741      4457.0
C63529          67318      4032.0
C78006          42950      2261.0
C84757          52443      4281.0
D16400          59895       382.0
D30399          52812      2426.0
D36705          56319       911.0
D46657          49504      4228.0
D63484          40754      1454.0
D76182          49059      3814.0

In [69]:
df41.loc['sum']=df41.sum()

In [70]:
df41

         CPF Matrícula Nome Centro_de_Custo     Valor
0    8301607     37788   A1          C19751     480.0
1    2880529     42950   A2          C78006    2261.0
2    1765770     59895   A3          D16400     382.0
3    3413183     67318   A4          C63529     448.0
4    2305859     45910   A5          C49036    2684.0
5    6211373     54880   A6          C39952     421.0
6    6322341     28159   A7          B89499    3552.0
7    6397062     72522   A8          B90811    1448.0
8    2930254     25890   A9          B78962    1420.0
9    3886389     24338  A10          B21652      74.0
10   4032629     71007  A11          B39244    1379.0
11   2929816     56319  A12          D36705     911.0
12   9231990     83741  A13          C60653    3218.0
13   3180697     52443  A14          C84757    1941.0
14   7634570     89353  A15          B75592     329.0
15   8791000     69901  A16          B65036    2557.0
16   6237209     49059  A17          D76182    1237.0
17   3627792     49504  A18          D46657    2612.0
18   3623365     64710  A19          C22903    1043.0
19   3153344     33431  A20          C27388    3086.0
20   2587435     40754  A21          D63484     606.0
21   1912308     52812  A22          D30399    1524.0
22   9231990     83741  A13          C60653    1239.0
23   3180697     52443  A14          C84757    2340.0
24   7634570     89353  A15          B75592    1780.0
25   8791000     69901  A16          B65036     362.0
26   6237209     49059  A17          D76182    2577.0
27   3627792     49504  A18          D46657    1616.0
28   3623365     64710  A19          C22903    1432.0
29   3153344     33431  A20          C27388     105.0
30   2587435     40754  A21          D63484     848.0
31   1912308     52812  A22          D30399     902.0
32   3413183     67318   A4          C63529    2934.0
33   2305859     45910   A5          C49036    2782.0
34   6211373     54880   A6          C39952    1136.0
35   3413183     67318   A4          C63529     650.0
36   2305859     45910   A5          C49036    3113.0
37   6211373     54880   A6          C39952     458.0
38   6211373     54880   A6          C39952     240.0
sum      NaN       NaN  NaN             NaN  290635.0

In [65]:
pd.pivot_table(df41,values=['Valor'],index=['Centro_de_Custo','Matrícula'],aggfunc=np.sum).sum()

Valor    58127.0
dtype: float64

In [28]:
df4.groupby('Centro_de_Custo')